{
	"title": "F1 Visa Experiences",
	"id": "adiamaan/f1-visa-experiences",
	"subtitle": "Daily updated f1 visa experiences",
	"description": "### Context F1-Visa is a type of **non-immigrant** visa provided by the US Government to allow students to temporarily live in the US for a defined period of time while studying at a school. It is the **3rd most applied visa** in the whole world. For many students, it is the culmination of years of hard work and dedication. ![F1 interview experience](https://images.livemint.com/img/2021/08/23/1600x900/20210608071L_1629715737391_1629715753280.jpg) After appearing for TOEFL/IELTS, GRE and applying for schools of interest, and getting an admit, attending the Visa Interview is the next step, which arguably is also the toughest. It is a subjective process, where a Visa officer asks a serious of question to the prospective student and arrives at a conclusion deeming his fitness. An example for the denial could be, - Signs of family ties already present in the US (makes a student highly unlikely to return back to home country) - Lack of funds for education - No ties between experience and the major chosen - Questionable universities and academic performances The data comes from a telegram channel and all the visa experiences mainly are from India. I am working on adding more sources. So watch out! ## Code: You can find the scrapper and the Github action for this dataset here, https://github.com/adiamaan92/f1-visa-experience-scrapper > The scrapper is scheduled to run every day at 8 AM using a Github Action workflow. ### Acknowledgements A huge thanks to the mods of the Telegram channel, t.me/f1interviewreviews for moderating the community and pushing out new experiences frequently. ### Inspiration 1. What are some of the commonalities for getting your visa rejected? 2. India has embassies across multiple cities like Delhi, Mumbai, Kolkatta, Hyderabad, Chennai etc. Are the denials more likely to happen in a city? etc..",
	"isPrivate": false,
	"keywords": [
		"united states",
		"india",
		"education",
		"nlp"
	],
	"licenses": [
		{
			"name": "CC0-1.0"
		}
	],
	"collaborators": [],
	"data": []
}